題目 : 運用下列分數資料重新建構資料，將索引(index)依序改為sex、class、student_id，欄位依序改成chinese_score、english_score、math_score



score_df = pd.DataFrame([[1,50,80,70,'boy',1],[2,60,45,50,'boy',2],[3,98,43,55,'boy',1],[4,70,69,89,'boy',2],[5,56,79,60,'girl',1],[6,60,68,55,'girl',2],[7,45,70,77,'girl',1],[8,55,77,76,'girl',2],[9,25,57,60,'girl',1],[10,88,40,43,'girl',3],[11,25,60,45,'boy',3],[12,80,60,23,'boy',3],[13,20,90,66,'girl',3],[14,50,50,50,'girl',3],[15,89,67,77,'girl',3]],columns=['student_id','math_score','english_score','chinese_score','sex','class'])

In [24]:
import pandas as pd
import numpy as np
score_df = pd.DataFrame([[1,50,80,70,'boy',1],[2,60,45,50,'boy',2],
                         [3,98,43,55,'boy',1],[4,70,69,89,'boy',2],
                         [5,56,79,60,'girl',1],[6,60,68,55,'girl',2],
                         [7,45,70,77,'girl',1],[8,55,77,76,'girl',2],
                         [9,25,57,60,'girl',1],[10,88,40,43,'girl',3],
                         [11,25,60,45,'boy',3],[12,80,60,23,'boy',3],
                         [13,20,90,66,'girl',3],[14,50,50,50,'girl',3],
                         [15,89,67,77,'girl',3]],
                        columns=['student_id','math_score'
                                 ,'english_score','chinese_score'
                                 ,'sex','class'])
score_df

    student_id  math_score  english_score  chinese_score   sex  class
0            1          50             80             70   boy      1
1            2          60             45             50   boy      2
2            3          98             43             55   boy      1
3            4          70             69             89   boy      2
4            5          56             79             60  girl      1
5            6          60             68             55  girl      2
6            7          45             70             77  girl      1
7            8          55             77             76  girl      2
8            9          25             57             60  girl      1
9           10          88             40             43  girl      3
10          11          25             60             45   boy      3
11          12          80             60             23   boy      3
12          13          20             90             66  girl      3
13          14          50             50             50  girl      3
14          15          89             67             77  girl      3

In [21]:
#將索引(index)依序改為sex、class、student_id，欄位依序改成chinese_score、english_score、math_score

score_df.stack()

0   student_id          1
    math_score         50
    english_score      80
    chinese_score      70
    sex               boy
                     ...
14  math_score         89
    english_score      67
    chinese_score      77
    sex              girl
    class               3
Length: 90, dtype: object

In [16]:
score_df.melt(value_vars=['sex','class','student_id'])

      variable value
0          sex   boy
1          sex   boy
2          sex   boy
3          sex   boy
4          sex  girl
5          sex  girl
6          sex  girl
7          sex  girl
8          sex  girl
9          sex  girl
10         sex   boy
11         sex   boy
12         sex  girl
13         sex  girl
14         sex  girl
15       class     1
16       class     2
17       class     1
18       class     2
19       class     1
20       class     2
21       class     1
22       class     2
23       class     1
24       class     3
25       class     3
26       class     3
27       class     3
28       class     3
29       class     3
30  student_id     1
31  student_id     2
32  student_id     3
33  student_id     4
34  student_id     5
35  student_id     6
36  student_id     7
37  student_id     8
38  student_id     9
39  student_id    10
40  student_id    11
41  student_id    12
42  student_id    13
43  student_id    14
44  student_id    15